alexandercote/FreeRTOS_Traffic_Light_System/STM32F4_Discovery_FreeRTOS_Traffic_Light_Project/src/main.c
The malloc failed and stack overflow hook (or callback) functions:
These two hook functions are provided as examples, but do not contain any
functionality.
*/

/* Standard includes. */
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include "stm32f4_discovery.h"

/* Kernel includes. */
#include "stm32f4xx.h"
#include "../FreeRTOS_Source/include/FreeRTOS.h"
#include "../FreeRTOS_Source/include/queue.h"
#include "../FreeRTOS_Source/include/semphr.h"
#include "../FreeRTOS_Source/include/task.h"
#include "../FreeRTOS_Source/include/timers.h"

/*-----------------------------------------------------------*/

/*
 * TODO: Implement this function for any hardware specific clock configuration
 * that was not already performed before main() was called.
 */
static void prvSetupHardware( void );

/* The period of the example software timer, specified in milliseconds, and
converted to ticks using the portTICK_RATE_MS constant. */
#define mainSOFTWARE_TIMER_PERIOD_MS		( 1000 / portTICK_RATE_MS )

#define speedQUEUE_LENGTH 32
#define displayQUEUE_LENGTH 64
#define prelightactiveQUEUE_LENGTH 1


// Pinout Defines

#define ADC_PORT                 GPIOC
#define ADC_PIN                  GPIO_Pin_1

#define SHIFT_REG_1_PORT         GPIOE
#define SHIFT_REG_1_PIN          GPIO_Pin_5
#define SHIFT_REG_CLK_1_PIN      GPIO_Pin_3

#define SHIFT_REG_2_PORT         GPIOC
#define SHIFT_REG_2_PIN          GPIO_Pin_15
#define SHIFT_REG_CLK_2_PIN      GPIO_Pin_14
#define SHIFT_REG_RST_PIN        GPIO_Pin_13

#define TRAFFIC_LIGHT_PORT       GPIOD
#define TRAFFIC_LIGHT_RED_PIN    GPIO_Pin_6
#define TRAFFIC_LIGHT_YELLOW_PIN GPIO_Pin_4
#define TRAFFIC_LIGHT_GREEN_PIN  GPIO_Pin_2


// Traffic light task priorities
#define TRAFFIC_FLOW_TASK_PRIORITY      ( tskIDLE_PRIORITY + 1 )
#define TRAFFIC_CREATE_TASK_PRIORITY	( tskIDLE_PRIORITY + 2 )
#define TRAFFIC_LIGHT_TASK_PRIORITY     ( tskIDLE_PRIORITY + 2 )
#define TRAFFIC_DISPLAY_TASK_PRIORITY	( tskIDLE_PRIORITY  )


// Initialization declaration
void HardwareInit(void);

// Test task declaration
void ADCTestTask( void *pvParameters );
void ShiftTestTask( void *pvParameters );

// Helper function declarations
void ShiftRegisterValuePreLight( bool value );
void ShiftRegisterValuePostLight( bool value );

// Traffic Light task declarations
void TrafficFlowAdjustmentTask( void *pvParameters );
void TrafficCreatorTask( void *pvParameters );
void TrafficLightTask( void *pvParameters );
void TrafficDisplayTask( void *pvParameters );

//Timer declarations
static void vGreenLightTimerCallback( xTimerHandle xTimer );
static void vYellowLightTimerCallback( xTimerHandle xTimer );
static void vRedLightTimerCallback( xTimerHandle xTimer );

//Queue declarations
xQueueHandle xQueue_handle_speed_creator = 0;
xQueueHandle xQueue_handle_speed_light = 0;
xQueueHandle xQueue_handle_display_traffic = 0;
xQueueHandle xQueue_handle_prelight_active_traffic = 0;
xQueueHandle xQueue_handle_light_colour = 0;				// maybe replaced with interrupts and local variables


xTimerHandle xRedLightSoftwareTimer    = NULL;
xTimerHandle xYellowLightSoftwareTimer = NULL;
xTimerHandle xGreenLightSoftwareTimer  = NULL;

/*-----------------------------------------------------------*/

int main(void)
{
// new comment

	/* Configure the system ready to run the demo.  The clock configuration
	can be done here if it was not done before main() was called. */
	prvSetupHardware();

	HardwareInit();

    //Create Queues
    xQueue_handle_speed_creator           = xQueueCreate( 	speedQUEUE_LENGTH,		        /* The number of items the queue can hold. */
						                         	        sizeof( uint32_t ) );	        /* The size of each item the queue holds. */
    xQueue_handle_speed_light             = xQueueCreate( 	speedQUEUE_LENGTH,		        /* The number of items the queue can hold. */
						                       	            sizeof( uint32_t ) );	        /* The size of each item the queue holds. */
	// Queue of binary values, populated by Traffic_Creator_Task and read by Traffic_Display_Task
	xQueue_handle_display_traffic         = xQueueCreate(   displayQUEUE_LENGTH,
			                                                sizeof( uint32_t ));
	// Queue of binary values, that hold the 8 positions before the traffic light.
    uint32_t activelightlist[8] = {0, 0, 0, 0, 0, 0, 0, 0};	// removed one element to deal with warning 'excess elements in array initializer'
    xQueue_handle_prelight_active_traffic = xQueueCreate( 	prelightactiveQUEUE_LENGTH,		        /* The number of items the queue can hold. */
	                                                        sizeof( activelightlist ) );	        /* The size of each item the queue holds. */
    
    // initialize the active traffic queue with all 0's, as no cars are currently present on the road
    xQueueSend(xQueue_handle_prelight_active_traffic, &activelightlist, 10);

    /*
    int i = 0;
    int initialization_value = 0;
    for (i = 0; i++; i = prelightactiveQUEUE_LENGTH){
    	xQueueSend(xQueue_handle_prelight_active_traffic, &initialization_value, 10);
    }
    */

    // Current colour of the traffic light
    xQueue_handle_light_colour            = xQueueCreate( 	1,		                        /* The number of items the queue can hold. */
						                       	            sizeof( uint32_t ) );	        /* The size of each item the queue holds. */
    // initialize green light to start
	bool lightcolour = 1;                                               // 1 = green
	xQueueSend(xQueue_handle_light_colour, &lightcolour, 10);           // send the new light colour to the queue


	// turn on the green light on the traffic light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_GREEN_PIN);        // turn on green light


	// Traffic light tasks
	
	xTaskCreate( TrafficFlowAdjustmentTask , "FlowAdjust",configMINIMAL_STACK_SIZE ,NULL ,TRAFFIC_FLOW_TASK_PRIORITY,   NULL);
	xTaskCreate( TrafficCreatorTask        , "Creator"   ,configMINIMAL_STACK_SIZE ,NULL ,TRAFFIC_CREATE_TASK_PRIORITY, NULL);
	xTaskCreate( TrafficLightTask          , "Light"	 ,configMINIMAL_STACK_SIZE ,NULL ,TRAFFIC_LIGHT_TASK_PRIORITY,  NULL);
	xTaskCreate( TrafficDisplayTask        , "Display"   ,configMINIMAL_STACK_SIZE ,NULL ,TRAFFIC_DISPLAY_TASK_PRIORITY,NULL);

	xRedLightSoftwareTimer    = xTimerCreate("RedLightTimer"   ,   mainSOFTWARE_TIMER_PERIOD_MS, pdFALSE, ( void * ) 0,	vRedLightTimerCallback);
	xYellowLightSoftwareTimer = xTimerCreate("YellowLightTimer",   2000 / portTICK_PERIOD_MS   , pdFALSE, ( void * ) 0,	vYellowLightTimerCallback);
	xGreenLightSoftwareTimer  = xTimerCreate("GreenLightTimer" ,   mainSOFTWARE_TIMER_PERIOD_MS, pdFALSE, ( void * ) 0,	vGreenLightTimerCallback);

	xTimerStart( xGreenLightSoftwareTimer, 0 );


	/* Start the tasks and timer running. */
	vTaskStartScheduler();

