alexandercote/FreeRTOS_Traffic_Light_System/STM32F4_Discovery_FreeRTOS_Traffic_Light_Project/src/main.c
	return 0;
}
/*-----------------------------------------------------------*/

// Traffic light questions

/*  Traffic flow adjustment task: The traffic flow that enters the intersection is set
	by a potentiometer. This task reads the value of the potentiometer at proper
	intervals. The low resistance of the potentiometer corresponds to light traffic and
	a high resistance corresponds to heavy traffic. The reading by this task is sent
	and used by other tasks.
 */
void TrafficFlowAdjustmentTask ( void *pvParameters )
{
    uint16_t adc_value;
    uint16_t speed_adc_value;
    uint16_t current_speed_value = 0;
    uint16_t change_in_speed;

	while(1)
	{
		ADC_SoftwareStartConv(ADC1);		// wait for ADC to finish conversion

		while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));	// grab ADC value

		adc_value = ADC_GetConversionValue(ADC1);
		speed_adc_value = adc_value/512;

		if(speed_adc_value == 8)
		{
			speed_adc_value = 7;
		}

        change_in_speed = abs(speed_adc_value - current_speed_value);
        

	    if(change_in_speed !=  0) 	// will only do queue stuff if the speed changed.
	    {
	    	printf("FlowAdjustmentTask: change in speed = %d \n", change_in_speed);

	    	// speed changed, change value on queue

	    	xQueueReset( xQueue_handle_speed_creator ); // empty the queue, push new speed value onto the queue
	    	xQueueReset( xQueue_handle_light_colour );  // empty the queue, push new speed value onto the queue

	    	printf("FlowAdjustmentTask: ADC Value: %d = %d /7 \n", adc_value, speed_adc_value);

			if( xQueueSend(xQueue_handle_speed_creator, &speed_adc_value, 500))
			{
				printf("FlowAdjustmentTask: adc_value sent on speed creator queue.\n");
			}
			else
			{
				printf("FlowAdjustmentTask: Failed to send data on queue from TFA to TC tasks.\n");
			}

			if( xQueueSend(xQueue_handle_speed_light, &speed_adc_value, 500))
			{
				printf("FlowAdjustmentTask: adc_value sent to light speed queue.\n");
			}
			else
			{
				printf("FlowAdjustmentTask: Failed to send data on queue from TFA to TL tasks.\n");
			}
			current_speed_value = speed_adc_value; // save previous speed value

	    } // end if speed changed

        vTaskDelay(100);
        
	}
} // end Traffic_Flow_Adjustment_Task

/*  Traffic creator task: This task generates random traffic with a rate that is
	based on the potentiometer value reading. This value is received from the traffic
	flow adjustment task. The created traffic is sent to the task that displays the flow
	of the cars on the road.
 */

void TrafficCreatorTask ( void *pvParameters )
{
	uint16_t received;
	uint16_t send;

	while(1)
		{
			if(xQueueReceive(xQueue_handle_speed_creator, &received, 10))
			{
				xQueueSend(xQueue_handle_speed_creator, &received, 10);	// print the received value to console

				printf("CreatorTask: received  %u. \n", received );

				/* compute the value for the display (0/1)
				 * received should be a value 1-8
				 * generate random number range[0:100]
				 * if the random number is below 100/(8 - value from traffic flow task) create a car
				 * if the value from traffic flow task is high, there is a higher probability of a car being created
				*/
				send = (rand() % 100 ) < 100/(8 - received);

				if(xQueueSend(xQueue_handle_display_traffic, &send, 10))	// send the display value to the display queue
				{
					printf("CreatorTask: sending the value %d to display queue \n", send);
				}
				else
				{
					printf("CreatorTask: error Nothing to send\n");
				}

			}
			else
			{
				printf("CreatorTask: Nothing in the Speed Queue");
			}
			vTaskDelay(500);
		}
} // end Traffic_Creator_Task

/*  Traffic light task: This task controls the timing of the traffic light. This timing is
	affected by the load of the traffic which is received from the traffic flow
	adjustment task.
*/
void TrafficDisplayTask ( void *pvParameters )
{
	//get value from traffic creator
	uint16_t car_value = 0;
	uint16_t light_value;
    uint32_t currentactiveprelighttraffic[8]; // 0 is newest element, 7 is at the traffic light
    uint32_t newactiveprelighttraffic[8];

	while(1)
		{
			if(xQueueReceive(xQueue_handle_display_traffic, &car_value, 10)) 	// if there are values in the Display traffic queue (sent by traffic creator task)
			{
				xQueueSend(xQueue_handle_display_traffic, &car_value, 10);
				printf("DisplayTask: car = %d \n", car_value );

				if(xQueueReceive(xQueue_handle_light_colour, &light_value, 10))	//light colour queue has an item
				{
					//NOT RECEIVING GREEN LIGHT VALUE ONLY RED LIGHT???
					xQueueSend(xQueue_handle_light_colour, &light_value, 10); // put back the current light value for future use
					printf("DisplayTask: light colour = %d \n", light_value);

					if(xQueueReceive(xQueue_handle_prelight_active_traffic, &currentactiveprelighttraffic, 10))		// If there are values in the prelight queue
					{
						printf("DisplayTask: received the value %u. \n", car_value ); // print the received value
						newactiveprelighttraffic[0] = car_value;
					}

					if(light_value == 1)		// light is green, shift values normally
					{
						printf("DisplayTask: Light is green, shifting normally. \n ");

						ShiftRegisterValuePreLight(car_value);
						ShiftRegisterValuePostLight(currentactiveprelighttraffic[7]);

						for (int i = 1; i != 8; i++)
						{
							newactiveprelighttraffic[i] = currentactiveprelighttraffic[i-1];
						}
					}
					else if(light_value == 0)		// light is red
					{
						printf("DisplayTask: Light is red, doing fast shift. \n ");

						// need to account for new value, and not push off cars
						int shiftcounter = 0;
						int encounteredzero = 0;
					    for (int i = 7; i != 1; i--)
					    {
	                        if(currentactiveprelighttraffic[i] == 0 && encounteredzero == 0)
	                        {
	                        	shiftcounter = 1;
	                        }

	                        newactiveprelighttraffic[i] = currentactiveprelighttraffic[i-shiftcounter]; // grab the next value

	                        if(shiftcounter == 1 && encounteredzero == 0)
	                        {
	                        	encounteredzero = 1;
	                        	i--;
	                        }

