alexandercote/FreeRTOS_Traffic_Light_System/STM32F4_Discovery_FreeRTOS_Traffic_Light_Project/src/main.c
					    }// end for

					    for (int i = 7; i != 1; i--)
					    {
					    	ShiftRegisterValuePreLight(newactiveprelighttraffic[i]);
					    }


					} // else red
					else
					{
						printf("light is not red or green??\n");
					}

				}

					ShiftRegisterValuePostLight(0); //nothing go threw traffic light, so no car.

			} // end light value else



			xQueueSend(xQueue_handle_prelight_active_traffic, &newactiveprelighttraffic, 10);
			printf("DisplayTask: pre-light traffic sent to queue \n");


			vTaskDelay(500);
		}
} // end Traffic_Display_Task



static void vGreenLightTimerCallback( xTimerHandle xTimer )
{
	// green light time is up, change the light to red
	// set some flag or something for the display controller
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_GREEN_PIN);        // turn off green light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_YELLOW_PIN);         // turn on yellow light
	printf("GreenLightTimer: Green Light Off, Yellow light on. \n");
	xTimerStart( xYellowLightSoftwareTimer, 0 );
}
static void vYellowLightTimerCallback( xTimerHandle xTimer )
	{
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_YELLOW_PIN);       // turn off yellow light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_RED_PIN);            // turn on red light
	xQueueReset( xQueue_handle_light_colour );                          // wipe the current light value on the queue
	uint16_t lightcolour = 0;                                               // 1 = green, 0 = red
	xQueueSend(xQueue_handle_light_colour, &lightcolour, 10);           // send the new light colour to the queue
	printf("YellowLightTimer: Yellow light off, red light on. colour = %d was sent to queue. \n", lightcolour);
	xTimerStart( xRedLightSoftwareTimer, 0 );
}
static void vRedLightTimerCallback( xTimerHandle xTimer )
{
	GPIO_ResetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_RED_PIN);          // turn off red light
	GPIO_SetBits(TRAFFIC_LIGHT_PORT, TRAFFIC_LIGHT_GREEN_PIN);          // turn on green light
	xQueueReset( xQueue_handle_light_colour );                          // wipe the current light value on the queue
	uint16_t lightcolour = 1;                                               // 1 = green, 0 = red
	xQueueSend(xQueue_handle_light_colour, &lightcolour, 10);           // send the new light colour to the queue
	printf("RedLightTimer: Red light off, green light on. colour = %d was sent to queue. \n", lightcolour);
	xTimerStart( xGreenLightSoftwareTimer, 0 );
}

/*  Traffic light task: This task controls the timing of the traffic light. This timing is
	affected by the load of the traffic which is received from the traffic flow
	adjustment task.
*/
void TrafficLightTask ( void *pvParameters )
{
	// get speed
	// given speed, change timing

	//get value from traffic flow adjustment
	uint16_t new_speed_value = 0;
	uint16_t current_speed_value = 0;

	while(1)
		{
			if(xQueueReceive(xQueue_handle_speed_light, &new_speed_value, 10))
			{
				xQueueSend(xQueue_handle_speed_light, &new_speed_value, 10); // send back the value onto the queue for future use
				// print the received value to console
				printf("LightTask: received the value %u. \n", new_speed_value );

			    if(current_speed_value !=  new_speed_value)
			    { // speed changed, changed timer
			    	if(xTimerIsTimerActive( xGreenLightSoftwareTimer ))
			    	{
			    		xTimerStop(xGreenLightSoftwareTimer, 0);
				    	xTimerChangePeriod(xGreenLightSoftwareTimer, (5000 + 2000 * (8-new_speed_value))  / portTICK_PERIOD_MS, 0 );
				    	xTimerChangePeriod(xRedLightSoftwareTimer, (3000 + 500 * (8-new_speed_value)) / portTICK_PERIOD_MS, 0 );
				    	xTimerStop(xRedLightSoftwareTimer, 0);
				    	//xTimerStart( xGreenLightSoftwareTimer, 0 );
			    	}
			    	else if(xTimerIsTimerActive( xYellowLightSoftwareTimer ))
			    	{
			    		//xTimerStop(xYellowLightSoftwareTimer, 0);
				    	xTimerChangePeriod(xGreenLightSoftwareTimer, (5000 + 2000 * (8-new_speed_value))  / portTICK_PERIOD_MS, 0 );
				    	xTimerStop(xGreenLightSoftwareTimer, 0);
				    	xTimerChangePeriod(xRedLightSoftwareTimer, (3000 + 500 * (8-new_speed_value)) / portTICK_PERIOD_MS, 0 );
				    	xTimerStop(xRedLightSoftwareTimer, 0);
				    	//xTimerStart( xYellowLightSoftwareTimer, 0 );
			    	}
			    	else if(xTimerIsTimerActive( xRedLightSoftwareTimer ))
			    	{
			    		xTimerStop(xRedLightSoftwareTimer, 0);
				    	xTimerChangePeriod(xGreenLightSoftwareTimer, (5000 + 2000 * (8-new_speed_value))  / portTICK_PERIOD_MS, 0 );
				    	xTimerStop(xGreenLightSoftwareTimer, 0);
				    	xTimerChangePeriod(xRedLightSoftwareTimer, (3000 + 500 * (8-new_speed_value)) / portTICK_PERIOD_MS, 0 );
				    	//xTimerStart( xRedLightSoftwareTimer, 0 );
			    	}


			    }

			}
			vTaskDelay(500);
		}
} // end Traffic_Light_Task

/*
    Traffic display task: This task controls the LEDs that represent the cars at the
	intersection. It receives the traffic from traffic creator task and displays them on
	the LEDs. It refreshes the LEDs at a certain interval to emulate the flow of the
	traffic.
 */



void ShiftRegisterValuePreLight( bool value )
{
	printf("Shifting prelight register.\n");
	GPIO_ResetBits(SHIFT_REG_1_PORT, SHIFT_REG_CLK_1_PIN);      // ensure shift register clock is low
	if (value == false)                                             // no car present
		GPIO_ResetBits(SHIFT_REG_1_PORT, SHIFT_REG_1_PIN);	    // set output low
	else                                                        // car on the road at this location
		GPIO_SetBits(SHIFT_REG_1_PORT, SHIFT_REG_1_PIN);        // set output high
	GPIO_SetBits(SHIFT_REG_1_PORT, SHIFT_REG_CLK_1_PIN);        // set clock high
	//vTaskDelay(10);
	GPIO_ResetBits(SHIFT_REG_1_PORT, SHIFT_REG_CLK_1_PIN);      // set clock low again


}

void ShiftRegisterValuePostLight( bool value )
{
	GPIO_ResetBits(SHIFT_REG_2_PORT, SHIFT_REG_CLK_2_PIN);      // ensure shift register clock is low
	if (value == false)                                             // no car present
		GPIO_ResetBits(SHIFT_REG_2_PORT, SHIFT_REG_2_PIN);	    // set output low
	else                                                        // car on the road at this location
		GPIO_SetBits(SHIFT_REG_2_PORT, SHIFT_REG_2_PIN);        // set output high
	GPIO_SetBits(SHIFT_REG_2_PORT, SHIFT_REG_CLK_2_PIN);        // set clock high
	//vTaskDelay(10);
	GPIO_ResetBits(SHIFT_REG_2_PORT, SHIFT_REG_CLK_2_PIN);      // set clock low again
}

void ShiftTestTask ( void* pvParameters )
{
	while(1)
	{
		printf("ShiftTestTop!\n");
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( true );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( false );
		vTaskDelay(500);
		ShiftRegisterValuePreLight( false );
		vTaskDelay(500);
	}
} // end ShiftTestTask



void ADCTestTask( void* pvParameters)
{
	uint16_t adc_value;
	while(1)
	{
		ADC_SoftwareStartConv(ADC1);
		// wait for ADC to finish conversion
		while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));
		// grab ADC value
		adc_value = ADC_GetConversionValue(ADC1);
		printf("ADC Value: %d\n", adc_value);
		vTaskDelay(500);
	}
} // end ADCTestTask

